Revit 2027 API
SaveModifiedLinksOptionsForUnloadLocally Enumeration
 Class giving options when saving linked files which are unloaded locally and have been modified in-memory by shared coordinates operations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SaveModifiedLinksOptionsForUnloadLocally
Public Enumeration SaveModifiedLinksOptionsForUnloadLocally
public enum class SaveModifiedLinksOptionsForUnloadLocally
type SaveModifiedLinksOptionsForUnloadLocally
Members
Member name | Value | Description
DoNotSaveLinks | 1 |  Any modified linked files will not be saved. The links will return to their previous position the next time the file is loaded.
SaveLinks | 0 |  Any modified linked files will be saved.
See Also
Reference
Autodesk.Revit.DB Namespace